espressif/arduino-esp32/cores/esp32/esp32-hal-ledc.c
  uint8_t group = (channel / SOC_LEDC_CHANNEL_NUM);
  uint8_t timer = 0;
  bool channel_used = ledc_handle.used_channels & (1UL << channel);

  if (channel_used) {
    log_i("Channel %u is already set up, given frequency and resolution will be ignored", channel);
    if (ledc_set_pin(pin, group, channel % SOC_LEDC_CHANNEL_NUM) != ESP_OK) {
      log_e("Attaching pin to already used channel failed!");
      return false;
    }
  } else {
    // Find a timer with matching frequency and resolution, or a free timer
    if (!find_matching_timer(group, freq, resolution, &timer)) {
      if (!find_free_timer(group, &timer)) {
        log_w("No free timers available for speed mode %u", group);
        return false;
      }

      // Configure the timer if we're using a new one
      ledc_timer_config_t ledc_timer;
      memset((void *)&ledc_timer, 0, sizeof(ledc_timer_config_t));
      ledc_timer.speed_mode = group;
      ledc_timer.timer_num = timer;
      ledc_timer.duty_resolution = resolution;
      ledc_timer.freq_hz = freq;
      ledc_timer.clk_cfg = clock_source;

      if (ledc_timer_config(&ledc_timer) != ESP_OK) {
        log_e("ledc setup failed!");
        return false;
      }
    }

    uint32_t duty = ledc_get_duty(group, (channel % SOC_LEDC_CHANNEL_NUM));

    ledc_channel_config_t ledc_channel;
    memset((void *)&ledc_channel, 0, sizeof(ledc_channel_config_t));
    ledc_channel.speed_mode = group;
    ledc_channel.channel = (channel % SOC_LEDC_CHANNEL_NUM);
    ledc_channel.timer_sel = timer;
    ledc_channel.intr_type = LEDC_INTR_DISABLE;
    ledc_channel.gpio_num = pin;
    ledc_channel.duty = duty;
    ledc_channel.hpoint = 0;

    ledc_channel_config(&ledc_channel);
  }

  ledc_channel_handle_t *handle = (ledc_channel_handle_t *)malloc(sizeof(ledc_channel_handle_t));
  handle->pin = pin;
  handle->channel = channel;
  handle->timer_num = timer;
  handle->freq_hz = freq;
#ifndef SOC_LEDC_SUPPORT_FADE_STOP
  handle->lock = NULL;
#endif

  //get resolution of selected channel when used
  if (channel_used) {
    uint32_t channel_resolution = 0;
    ledc_ll_get_duty_resolution(LEDC_LL_GET_HW(), group, timer, &channel_resolution);
    log_i("Channel %u frequency: %" PRIu32 ", resolution: %" PRIu32, channel, ledc_get_freq(group, timer), channel_resolution);
    handle->channel_resolution = (uint8_t)channel_resolution;
  } else {
    handle->channel_resolution = resolution;
    ledc_handle.used_channels |= 1UL << channel;
  }

  if (!perimanSetPinBus(pin, ESP32_BUS_TYPE_LEDC, (void *)handle, channel, timer)) {
    ledcDetachBus((void *)handle);
    return false;
  }

  log_i("LEDC attached to pin %u (channel %u, resolution %u)", pin, channel, resolution);
  return true;
}

bool ledcAttach(uint8_t pin, uint32_t freq, uint8_t resolution) {
  int free_channel = ~ledc_handle.used_channels & (ledc_handle.used_channels + 1);
  if (free_channel == 0) {
    log_e("No more LEDC channels available! (maximum is %u channels)", LEDC_CHANNELS);
    return false;
  }
  uint8_t channel = __builtin_ctz(free_channel);  // Convert the free_channel bit to channel number

  // Try the first available channel
  if (ledcAttachChannel(pin, freq, resolution, channel)) {
    return true;
  }

#ifdef SOC_LEDC_SUPPORT_HS_MODE
  // If first attempt failed and HS mode is supported, try to find a free channel in group 1
  if ((channel / SOC_LEDC_CHANNEL_NUM) == 0) {  // First attempt was in group 0
    log_d("LEDC: Group 0 channel %u failed, trying to find a free channel in group 1", channel);
    // Find free channels specifically in group 1
    uint32_t group1_mask = ((1UL << SOC_LEDC_CHANNEL_NUM) - 1) << SOC_LEDC_CHANNEL_NUM;
    int group1_free_channel = (~ledc_handle.used_channels) & group1_mask;
    if (group1_free_channel != 0) {
      uint8_t group1_channel = __builtin_ctz(group1_free_channel);
      if (ledcAttachChannel(pin, freq, resolution, group1_channel)) {
        return true;
      }
    }
  }
#endif

  log_e(
    "No free timers available for freq=%" PRIu32
    ", resolution=%u. To attach a new channel, use the same frequency and resolution as an already attached channel to "
    "share its timer.",
    freq, resolution
  );
  return false;
}

bool ledcWrite(uint8_t pin, uint32_t duty) {
  ledc_channel_handle_t *bus = (ledc_channel_handle_t *)perimanGetPinBus(pin, ESP32_BUS_TYPE_LEDC);
  if (bus != NULL) {

    uint8_t group = (bus->channel / SOC_LEDC_CHANNEL_NUM), channel = (bus->channel % SOC_LEDC_CHANNEL_NUM);

    //Fixing if all bits in resolution is set = LEDC FULL ON
    uint32_t max_duty = (1 << bus->channel_resolution) - 1;

    if ((duty == max_duty) && (max_duty != 1)) {
      duty = max_duty + 1;
    }

    if (ledc_set_duty(group, channel, duty) != ESP_OK) {
      log_e("ledc_set_duty failed");
      return false;
    }
    if (ledc_update_duty(group, channel) != ESP_OK) {
      log_e("ledc_update_duty failed");
      return false;
    }

    return true;
  }
  return false;
}

bool ledcWriteChannel(uint8_t channel, uint32_t duty) {
  //check if channel is valid and used
  if (channel >= LEDC_CHANNELS || !(ledc_handle.used_channels & (1UL << channel))) {
    log_e("Channel %u is not available (maximum %u) or not used!", channel, LEDC_CHANNELS);
    return false;
  }
  uint8_t group = (channel / SOC_LEDC_CHANNEL_NUM);
  ledc_timer_t timer;

  // Get the actual timer being used by this channel
  ledc_ll_get_channel_timer(LEDC_LL_GET_HW(), group, (channel % SOC_LEDC_CHANNEL_NUM), &timer);

  //Fixing if all bits in resolution is set = LEDC FULL ON
  uint32_t resolution = 0;
  ledc_ll_get_duty_resolution(LEDC_LL_GET_HW(), group, timer, &resolution);

  uint32_t max_duty = (1 << resolution) - 1;

  if ((duty == max_duty) && (max_duty != 1)) {
    duty = max_duty + 1;
  }

  if (ledc_set_duty(group, channel, duty) != ESP_OK) {
    log_e("ledc_set_duty failed");
    return false;
  }
  if (ledc_update_duty(group, channel) != ESP_OK) {
    log_e("ledc_update_duty failed");
    return false;
  }

